# FillBack

## Description
Procedure FillBack sets the active fill background color setting for the document. RGB values are in the range of 0~65535.

```pascal
PROCEDURE FillBack(color : LONGINT);
```

```python
def vs.FillBack(color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|color|LONGINT|RGB color value to set as active fill background color.|

## Remarks
*\_c\_* 2015.05.19: This routine will also accept a single INTEGER Color Palette Index value in lieu of three LONGINT RGB values for the COLOR parameter. The Color index can be obtained with RGBToColorIndex. See remarks under SetPenFore for more infos. On Vectorlab there is a list of all color routines accepting multiple variable type, see: [http://www.vectorlab.info/index.php?title=Index_pitfalls#Colors Color Index].

## Examples
#### VectorScript ####
```pascal
FillBack(65535, 0, 39321); { using RGB values }

colorIndex := RGBToColorIndex(65535, 0, 39321);
FillBack(colorIndex); { using Color Index values }
```
#### Python ####
```python
vs.FillBack((65535, 0, 39321)) # using RGB values

colorIndex = vs.RGBToColorIndex(65535, 0, 39321)
vs.FillBack(colorIndex) # using Color Index values
```

```pascal
BEGIN
	pushattrs;
	fillpat(1);
	fillback(65535,42000,0);
	BeginMXtrd(0.0,cWidth/3);
		Oval(-cWidth/6,-cWidth/6,cWidth/6,cWidth/6);
		Oval(-cWidth/6,-cWidth/6,cWidth/6,cWidth/6);
		Oval(-cWidth/9,-cWidth/9,cWidth/9,cWidth/9);

	PenFore (r,g,b);
	Pensize (GetLW (gWallHand));
	PenPatN (GetLSN (gWallHand));
	GetFillBack (gWallHand,r,g,b);
	FillBack (r,g,b);
END;

SetLW(TempH,gGypLW);
PenSize(gStippleLW);
ColorIndexToRGB(gStippleFill,Red,Green,Blue);
FillFore(Red,Green,Blue);
FillBack(Red,Green,Blue);
ColorIndexToRGB(gStippleColor,Red,Green,Blue);
PenFore(Red,Green,Blue);
PenBack(Red,Green,Blue);
TempH := Stipple(SolidPoly, gStippleShape, gStippleDensity, gStippleClip, gStippleMinSize, gStippleMaxSize, gStippleMinAsp, gStippleMaxAsp, gStippleRand); END;
```
```python
rgb = vs.GetFillBack( objHand )
vs.FillBack( rgb )
```

## See Also
VS Functions:
RGBToColorIndex
| ColorIndexToRGB

## Version
Availability: from All Versions

## Category
* Document Attributes